
Перем КонтекстЯдра;
Перем Утверждения;

#Область СлужебныйИнтерфейс

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
КонецПроцедуры // Инициализация()

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_Проверить_НаличиеМодуляUpdateExpressПроцессорВывода");
	НаборТестов.Добавить("Тест_Проверить_НаличиеМодуляUpdateExpressПроцессорВыводаПовтИсп");
	НаборТестов.Добавить("Тест_Проверить_НаличиеМодуляUpdateExpressКомпоновкаДанных");
	НаборТестов.Добавить("Тест_Проверить_НаличиеМодуляUpdateExpressСлужебный");
	НаборТестов.Добавить("Тест_Проверить_НаличиеМодуляUpdateExpressСлужебныйКлиентСервер");
	НаборТестов.Добавить("Тест_Проверить_НаличиеМодуляUpdateExpressСлужебныйПовтИсп");
	
КонецПроцедуры // ЗаполнитьНаборТестов()

#КонецОбласти // СлужебныйИнтерфейс

#Область ТестовыеСлучаи

Процедура Тест_Проверить_НаличиеМодуляUpdateExpressКомпоновкаДанных() Экспорт
		
	Результат = Метаданные.ОбщиеМодули.Найти("UpdateExpressКомпоновкаДанных");
	
	Утверждения.ПроверитьТип(Результат, "ОбъектМетаданных");
	 
	Утверждения.ПроверитьЛожь(Результат.Глобальный);
	
	Утверждения.ПроверитьЛожь(Результат.КлиентУправляемоеПриложение);
	Утверждения.ПроверитьИстину(Результат.Сервер);
	Утверждения.ПроверитьИстину(Результат.ВнешнееСоединение);
	Утверждения.ПроверитьИстину(Результат.КлиентОбычноеПриложение);
	
	Утверждения.ПроверитьЛожь(Результат.Привилегированный);
	Утверждения.ПроверитьЛожь(Результат.ВызовСервера);
	
	Утверждения.ПроверитьРавенство(Результат.ПовторноеИспользованиеВозвращаемыхЗначений, 
		Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НеИспользовать);

КонецПроцедуры // Тест_Проверить_НаличиеМодуляUpdateExpressКомпоновкаДанных()

Процедура Тест_Проверить_НаличиеМодуляUpdateExpressПроцессорВывода() Экспорт
	
	Результат = Метаданные.ОбщиеМодули.Найти("UpdateExpressПроцессорВывода");
	
	Утверждения.ПроверитьТип(Результат, "ОбъектМетаданных");
	 
	Утверждения.ПроверитьЛожь(Результат.Глобальный);
	
	Утверждения.ПроверитьЛожь(Результат.КлиентУправляемоеПриложение);
	Утверждения.ПроверитьИстину(Результат.Сервер);
	Утверждения.ПроверитьИстину(Результат.ВнешнееСоединение);
	Утверждения.ПроверитьИстину(Результат.КлиентОбычноеПриложение);
	
	Утверждения.ПроверитьЛожь(Результат.Привилегированный);
	Утверждения.ПроверитьЛожь(Результат.ВызовСервера);
	
	Утверждения.ПроверитьРавенство(Результат.ПовторноеИспользованиеВозвращаемыхЗначений, 
		Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НеИспользовать);
	
КонецПроцедуры // Тест_Проверить_НаличиеМодуляUpdateExpressПроцессорВывода()

Процедура Тест_Проверить_НаличиеМодуляUpdateExpressПроцессорВыводаПовтИсп() Экспорт
		
	Результат = Метаданные.ОбщиеМодули.Найти("UpdateExpressПроцессорВыводаПовтИсп");
	
	Утверждения.ПроверитьТип(Результат, "ОбъектМетаданных");
	 
	Утверждения.ПроверитьЛожь(Результат.Глобальный);
	
	Утверждения.ПроверитьЛожь(Результат.КлиентУправляемоеПриложение);
	Утверждения.ПроверитьИстину(Результат.Сервер);
	Утверждения.ПроверитьИстину(Результат.ВнешнееСоединение);
	Утверждения.ПроверитьИстину(Результат.КлиентОбычноеПриложение);
	
	Утверждения.ПроверитьЛожь(Результат.Привилегированный);
	Утверждения.ПроверитьЛожь(Результат.ВызовСервера);
	
	Утверждения.ПроверитьРавенство(Результат.ПовторноеИспользованиеВозвращаемыхЗначений, 
		Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НаВремяВызова);
	
КонецПроцедуры // Тест_Проверить_НаличиеМодуляUpdateExpressПроцессорВыводаПовтИсп()

Процедура Тест_Проверить_НаличиеМодуляUpdateExpressСлужебный() Экспорт
		
	Результат = Метаданные.ОбщиеМодули.Найти("UpdateExpressСлужебный");
	
	Утверждения.ПроверитьТип(Результат, "ОбъектМетаданных");
	 
	Утверждения.ПроверитьЛожь(Результат.Глобальный);
	
	Утверждения.ПроверитьЛожь(Результат.КлиентУправляемоеПриложение);
	Утверждения.ПроверитьИстину(Результат.Сервер);
	Утверждения.ПроверитьИстину(Результат.ВнешнееСоединение);
	Утверждения.ПроверитьИстину(Результат.КлиентОбычноеПриложение);
	
	Утверждения.ПроверитьЛожь(Результат.Привилегированный);
	Утверждения.ПроверитьЛожь(Результат.ВызовСервера);
	
	Утверждения.ПроверитьРавенство(Результат.ПовторноеИспользованиеВозвращаемыхЗначений, 
		Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НеИспользовать);

КонецПроцедуры // Тест_Проверить_НаличиеМодуляUpdateExpressСлужебный()

Процедура Тест_Проверить_НаличиеМодуляUpdateExpressСлужебныйКлиентСервер() Экспорт
		
	Результат = Метаданные.ОбщиеМодули.Найти("UpdateExpressСлужебныйКлиентСервер");
	
	Утверждения.ПроверитьТип(Результат, "ОбъектМетаданных");
	 
	Утверждения.ПроверитьЛожь(Результат.Глобальный);
	
	Утверждения.ПроверитьИстину(Результат.КлиентУправляемоеПриложение);
	Утверждения.ПроверитьИстину(Результат.Сервер);
	Утверждения.ПроверитьИстину(Результат.ВнешнееСоединение);
	Утверждения.ПроверитьИстину(Результат.КлиентОбычноеПриложение);
	
	Утверждения.ПроверитьЛожь(Результат.Привилегированный);
	Утверждения.ПроверитьЛожь(Результат.ВызовСервера);
	
	Утверждения.ПроверитьРавенство(Результат.ПовторноеИспользованиеВозвращаемыхЗначений, 
		Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НеИспользовать);
	
КонецПроцедуры // Тест_Проверить_НаличиеМодуляUpdateExpressСлужебныйКлиентСервер()

Процедура Тест_Проверить_НаличиеМодуляUpdateExpressСлужебныйПовтИсп() Экспорт
		
	Результат = Метаданные.ОбщиеМодули.Найти("UpdateExpressСлужебныйПовтИсп");
	
	Утверждения.ПроверитьТип(Результат, "ОбъектМетаданных");
	 
	Утверждения.ПроверитьЛожь(Результат.Глобальный);
	
	Утверждения.ПроверитьЛожь(Результат.КлиентУправляемоеПриложение);
	Утверждения.ПроверитьИстину(Результат.Сервер);
	Утверждения.ПроверитьИстину(Результат.ВнешнееСоединение);
	Утверждения.ПроверитьИстину(Результат.КлиентОбычноеПриложение);
	
	Утверждения.ПроверитьЛожь(Результат.Привилегированный);
	Утверждения.ПроверитьЛожь(Результат.ВызовСервера);
	
	Утверждения.ПроверитьРавенство(Результат.ПовторноеИспользованиеВозвращаемыхЗначений, 
		Метаданные.СвойстваОбъектов.ПовторноеИспользованиеВозвращаемыхЗначений.НаВремяВызова);
	
КонецПроцедуры // Тест_Проверить_НаличиеМодуляUpdateExpressСлужебныйПовтИсп()

#КонецОбласти // ТестовыеСлучаи