
Перем КонтекстЯдра;
Перем Утверждения;

#Область СлужебныйИнтерфейс

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
КонецПроцедуры // Инициализация()

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Тест_Проверить_ПустойМакетКомпоновкиДанных");
	НаборТестов.Добавить("Тест_Проверить_1ДетальнаяЗапись");
	НаборТестов.Добавить("Тест_Проверить_1ДетальныеЗаписи");
	НаборТестов.Добавить("Тест_Проверить_1ДетальныеЗаписи_11ДетальныеЗаписи");
	НаборТестов.Добавить("Тест_Проверить_1Группировка");
	НаборТестов.Добавить("Тест_Проверить_1Группировка_11ДетальныеЗаписи");
	НаборТестов.Добавить("Тест_Проверить_1Группировка_11ДетальныеЗаписи_12Группировка_123ДетальныеЗаписи");
	НаборТестов.Добавить("Тест_Проверить_Ресурс_1Группировка_11ДетальныеЗаписи_111Группировка");
	НаборТестов.Добавить("Тест_Проверить_ВложенныйРесурс_1Группировка_11Группировка_111ДетальныеЗаписи");

КонецПроцедуры // ЗаполнитьНаборТестов()

#КонецОбласти // СлужебныйИнтерфейс

#Область ТестовыеСлучаи

Процедура Тест_Проверить_ПустойМакетКомпоновкиДанных() Экспорт
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	UpdateExpressПроцессорВывода.Вывести(ЗаписьJSON, СхемаКомпоновкиДанных, 
		СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	Результат = ЗаписьJSON.Закрыть();
	
	Утверждения.ПроверитьРавенство(Результат, "{}");	
	
КонецПроцедуры // Тест_Проверить_ПустойМакетКомпоновкиДанных() 

Процедура Тест_Проверить_1ДетальнаяЗапись() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""ЭтоXMLСтрока"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Код"": 1,
		|""ИмяПредопределенныхДанных"": ""ПредопределенноеЗначение1"",
		|""Наименование"": ""Предопределенное значение"",
		|""ПометкаУдаления"": false,
		|""РеквизитБулево"": false,
		|""Предопределенный"": true,
		|""РеквизитПеречисление"": """"
		|}
		|]
		|}";
		
	ПроверитьУтверждение("Тест_Одна_Дет_Запись", "transfer", ТестовыеДанные);
	
КонецПроцедуры // Тест_Проверить_1ДетальнаяЗапись()
	
Процедура Тест_Проверить_1ДетальныеЗаписи() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""Наименование"": ""Предопределенное значение"",
		|""ПометкаУдаления"": false,
		|""РеквизитБулево"": false,
		|""Код"": 1,
		|""Ссылка"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61""
		|},
		|{
		|""Наименование"": ""Простое значение №1"",
		|""ПометкаУдаления"": false,
		|""РеквизитБулево"": true,
		|""Код"": 2,
		|""Ссылка"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61""
		|}
		|]
		|}";
		
	ПроверитьУтверждение("Тест_Две_Дет_Записи", "transfer", ТестовыеДанные);	
	
КонецПроцедуры // Тест_Проверить_1ДетальныеЗаписи()

Процедура Тест_Проверить_1ДетальныеЗаписи_11ДетальныеЗаписи() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""СтрокаXML"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Код"": 1,
		|""Наименование"": ""Предопределенное значение"",
		|""Предопределенный"": true,
		|""РеквизитБулево"": false,
		|""ПометкаУдаления"": false,
		|""Группировка"": [
		|{
		|""СтрокаXML"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Код"": 1,
		|""Наименование"": ""Предопределенное значение"",
		|""Предопределенный"": true,
		|""РеквизитБулево"": false,
		|""ПометкаУдаления"": false
		|}
		|]
		|},
		|{
		|""СтрокаXML"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Код"": 2,
		|""Наименование"": ""Простое значение №1"",
		|""Предопределенный"": false,
		|""РеквизитБулево"": true,
		|""ПометкаУдаления"": false,
		|""Группировка"": [
		|{
		|""СтрокаXML"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Код"": 2,
		|""Наименование"": ""Простое значение №1"",
		|""Предопределенный"": false,
		|""РеквизитБулево"": true,
		|""ПометкаУдаления"": false
		|}
		|]
		|}
		|]
		|}";
		
	ПроверитьУтверждение("Тест_Иерархия_Дет_Записей", "transfer", ТестовыеДанные);	
		
КонецПроцедуры // Тест_Проверить_1ДетальныеЗаписи_11ДетальныеЗаписи()

Процедура Тест_Проверить_1Группировка() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""Ссылка"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61""
		|},
		|{
		|""Ссылка"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61""
		|}
		|]
		|}";
		
	ПроверитьУтверждение("Тест_Одна_Группировка", "transfer", ТестовыеДанные);	
	
КонецПроцедуры // Тест_Проверить_1Группировка()

Процедура Тест_Проверить_1Группировка_11ДетальныеЗаписи() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""СсылкаUUID"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Details"": [
		|{
		|""ИмяПредопределенныхДанных"": ""ПредопределенноеЗначение1"",
		|""Код"": 1,
		|""Наименование"": ""Предопределенное значение"",
		|""ПометкаУдаления"": false,
		|""Предопределенный"": true,
		|""РеквизитБулево"": false
		|}
		|]
		|},
		|{
		|""СсылкаUUID"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Details"": [
		|{
		|""ИмяПредопределенныхДанных"": """",
		|""Код"": 2,
		|""Наименование"": ""Простое значение №1"",
		|""ПометкаУдаления"": false,
		|""Предопределенный"": false,
		|""РеквизитБулево"": true
		|}
		|]
		|}
		|]
		|}";
	
	ПроверитьУтверждение("Тест_Группировка_И_Дет", "transfer", ТестовыеДанные);
		
КонецПроцедуры // Тест_Проверить_1Группировка_11ДетальныеЗаписи()

Процедура Тест_Проверить_1Группировка_11ДетальныеЗаписи_12Группировка_123ДетальныеЗаписи() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""СсылкаUUID"": ""85bb650f-a4f5-11e6-830d-ac220b83ed61"",
		|""Ссылка"": ""85bb650f-a4f5-11e6-830d-ac220b83ed61"",
		|""Details"": [
		|{
		|""ИмяПредопределенныхДанных"": """",
		|""Код"": 3,
		|""Наименование"": ""Наименование #2"",
		|""ПометкаУдаления"": false,
		|""Предопределенный"": false,
		|""РеквизитБулево"": false
		|}
		|],
		|""Reference"": [
		|{
		|""Ссылка"": ""85bb650f-a4f5-11e6-830d-ac220b83ed61"",
		|""Наименование"": ""Наименование #2"",
		|""RefDetails"": [
		|{
		|""ИмяПредопределенныхДанных"": """",
		|""Код"": 3,
		|""ПометкаУдаления"": false,
		|""Предопределенный"": false,
		|""РеквизитБулево"": false
		|}
		|]
		|}
		|]
		|},
		|{
		|""СсылкаUUID"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Ссылка"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Details"": [
		|{
		|""ИмяПредопределенныхДанных"": ""ПредопределенноеЗначение1"",
		|""Код"": 1,
		|""Наименование"": ""Предопределенное значение"",
		|""ПометкаУдаления"": false,
		|""Предопределенный"": true,
		|""РеквизитБулево"": false
		|}
		|],
		|""Reference"": [
		|{
		|""Ссылка"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Наименование"": ""Предопределенное значение"",
		|""RefDetails"": [
		|{
		|""ИмяПредопределенныхДанных"": ""ПредопределенноеЗначение1"",
		|""Код"": 1,
		|""ПометкаУдаления"": false,
		|""Предопределенный"": true,
		|""РеквизитБулево"": false
		|}
		|]
		|}
		|]
		|},
		|{
		|""СсылкаUUID"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Ссылка"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Details"": [
		|{
		|""ИмяПредопределенныхДанных"": """",
		|""Код"": 2,
		|""Наименование"": ""Простое значение №1"",
		|""ПометкаУдаления"": false,
		|""Предопределенный"": false,
		|""РеквизитБулево"": true
		|}
		|],
		|""Reference"": [
		|{
		|""Ссылка"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Наименование"": ""Простое значение №1"",
		|""RefDetails"": [
		|{
		|""ИмяПредопределенныхДанных"": """",
		|""Код"": 2,
		|""ПометкаУдаления"": false,
		|""Предопределенный"": false,
		|""РеквизитБулево"": true
		|}
		|]
		|}
		|]
		|}
		|]
		|}";
		
	ПроверитьУтверждение("Тест_Груп2_Дет_Груп_Дет", "transfer", ТестовыеДанные);
	
КонецПроцедуры // Тест_Проверить_1Группировка_11ДетальныеЗаписи_12Группировка_123ДетальныеЗаписи()

Процедура Тест_Проверить_Ресурс_1Группировка_11ДетальныеЗаписи_111Группировка() Экспорт
	
	ТестовыеДанные = "{
		|""Группировка"": [
		|{
		|""ПростойСправочник"": ""85bb650f-a4f5-11e6-830d-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 102,
		|""Группировка2"": [
		|{
		|""Спр1UUID"": ""85bb650f-a4f5-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 51,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 51
		|}
		|]
		|},
		|{
		|""Спр1UUID"": ""85bb650f-a4f5-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7c2-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7c2-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 51,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7c2-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 51
		|}
		|]
		|}
		|]
		|},
		|{
		|""ПростойСправочник"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 11,
		|""Группировка2"": [
		|{
		|""Спр1UUID"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 1,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 1
		|}
		|]
		|},
		|{
		|""Спр1UUID"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7b9-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7b9-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 6,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7b9-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 6
		|}
		|]
		|},
		|{
		|""Спр1UUID"": ""3c4fbca9-a4ec-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7c2-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7c2-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 4,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7c2-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 4
		|}
		|]
		|}
		|]
		|},
		|{
		|""ПростойСправочник"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 68,
		|""Группировка2"": [
		|{
		|""Спр1UUID"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 57,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7b8-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 57
		|}
		|]
		|},
		|{
		|""Спр1UUID"": ""85bb6509-a4f5-11e6-830d-ac220b83ed61"",
		|""Спр2UUID"": ""bc63d7b9-a597-11e6-830e-ac220b83ed61"",
		|""ПростойСправочник2"": ""bc63d7b9-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 11,
		|""Группировка3"": [
		|{
		|""ПростойСправочник2"": ""bc63d7b9-a597-11e6-830e-ac220b83ed61"",
		|""РесурсЧислоОстаток"": 11
		|}
		|]
		|}
		|]
		|}
		|]
		|}";

	ПроверитьУтверждение("Тест_Рес_Гр1_Дет11_Гр111", "transfer", ТестовыеДанные);

КонецПроцедуры // Тест_Проверить_Ресурс_1Группировка_11ДетальныеЗаписи_111Группировка()

Процедура Тест_Проверить_ВложенныйРесурс_1Группировка_11Группировка_111ДетальныеЗаписи() Экспорт
	
	ТестовыеДанные = "{
		|""Data"": [
		|{
		|""Дата"": ""2016-11-08T11:49:17"",
		|""Номер"": ""000000004"",
		|""СоставРеквизитЧисло"": 11,
		|""Goods"": [
		|{
		|""СоставПростойСправочник2Наименование"": ""Ноутбук"",
		|""СоставРеквизитЧисло"": 1,
		|""Details"": [
		|{
		|""СоставРеквизитЧисло"": 1
		|}
		|]
		|},
		|{
		|""СоставПростойСправочник2Наименование"": ""Видео-карта"",
		|""СоставРеквизитЧисло"": 4,
		|""Details"": [
		|{
		|""СоставРеквизитЧисло"": 4
		|}
		|]
		|},
		|{
		|""СоставПростойСправочник2Наименование"": ""Винчестер"",
		|""СоставРеквизитЧисло"": 6,
		|""Details"": [
		|{
		|""СоставРеквизитЧисло"": 6
		|}
		|]
		|}
		|]
		|}
		|]
		|}";

	ПроверитьУтверждение("Тест_РесурсВложенВТаблицу", "transfer", ТестовыеДанные);
	
КонецПроцедуры // Тест_Проверить_ВложенныйРесурс_1Группировка_11Группировка_111ДетальныеЗаписи()

#КонецОбласти // ТестовыеСлучаи

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУтверждение(Наименование, ИмяКоманды, ТестовыеДанные)
	
	НастройкиЗапроса = UpdateExpressСлужебный.ПолучитьНастройкиКомандыОбмена(
		Наименование, ИмяКоманды);
		
	СхемаКомпоновкиДанных = НастройкиЗапроса.СхемаКомпоновкиДанных.Получить();	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	UpdateExpressКомпоновкаДанных.ИнициализироватьКомпоновщикНастроек(
		КомпоновщикНастроек,
		СхемаКомпоновкиДанных,
		ПоместитьВоВременноеХранилище(
			НастройкиЗапроса.НастройкиКомпоновкиДанных.Получить()));
	
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	UpdateExpressПроцессорВывода.Вывести(ЗаписьJSON, СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки());
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	Результат = ЗаписьJSON.Закрыть();
	
	Утверждения.ПроверитьРавенство(УдалитьПереносыСтрок(Результат),
		УдалитьПереносыСтрок(ТестовыеДанные));		
	
КонецПроцедуры // ПроверитьУтверждение()

Функция УдалитьПереносыСтрок(Строка)
	
	НоваяСтрока = Строка;
	НоваяСтрока = СтрЗаменить(НоваяСтрока, Символы.ПС, "");
	НоваяСтрока = СтрЗаменить(НоваяСтрока, Символы.ВК, "");
	НоваяСтрока = СтрЗаменить(НоваяСтрока, Символы.ВК + Символы.ПС, "");
	Возврат НоваяСтрока;
	
КонецФункции // УдалитьПереносыСтрок()

#КонецОбласти // СлужебныеПроцедурыИФункции
