Перем КонтекстЯдра;
Перем Утверждения;

#Область СлужебныйИнтерфейс

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
КонецПроцедуры // Инициализация()

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
		
	НаборТестов.Добавить("Тест_Проверить_ФункциюЭтоПолеРесурс");
		
КонецПроцедуры // ЗаполнитьНаборТестов()

#КонецОбласти // СлужебныйИнтерфейс

#Область ТестовыеСлучаи

Процедура Тест_Проверить_ФункциюЭтоПолеРесурс() Экспорт
	
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("Сумма ("));
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("среднее ("));
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("Максимум("));
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("МиНимум ("));
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("кОЛИЧЕСТВО("));
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("ВыРаЗиТь    ("));
	Утверждения.ПроверитьИстину(UpdateExpressПроцессорВыводаПовтИсп
		.ЭтоПолеРесурс("вЫчислитьВыражение    ("));
	
КонецПроцедуры // Тест_Проверить_ФункциюЭтоПолеРесурс()

#КонецОбласти // ТестовыеСлучаи