/////////////////////////////////////////////////////////////////////////
//                                                                     //
// This Source Code Form is subject to the terms of the Mozilla Public //
// License, v. 2.0. If a copy of the MPL was not distributed with this //
// file, You can obtain one at http://mozilla.org/MPL/2.0/.            //
//                                                                     //
/////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ЭтоПолеРесурс(Знач Выражение) Экспорт
	
	Выражение = СтрЗаменить(Выражение, Символ(32), "");
	Выражение = СтрЗаменить(Выражение, Символ(160), "");
	Выражение = СтрЗаменить(Выражение, Символы.ПС, "");
	Выражение = СтрЗаменить(Выражение, Символы.ВК, "");
	Выражение = СтрЗаменить(Выражение, Символы.ВК + Символы.ПС, "");
	Выражение = ВРег(Выражение);
	
	Если Найти(Выражение, "СУММА(") = 1 
	 ИЛИ Найти(Выражение, "СРЕДНЕЕ(") = 1
	 ИЛИ Найти(Выражение, "МАКСИМУМ(") = 1
	 ИЛИ Найти(Выражение, "МИНИМУМ(") = 1
	 ИЛИ Найти(Выражение, "КОЛИЧЕСТВО(") = 1
	 ИЛИ Найти(Выражение, "ВЫРАЗИТЬ(") = 1
	 ИЛИ Найти(Выражение, "ВЫЧИСЛИТЬВЫРАЖЕНИЕ(") = 1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции // ЭтоПолеРесурс()

Функция ФункцияПреобразования(Свойство, Значение, ДополнительныеПараметры,
	Отказ) Экспорт
	
	Если Значение = Null Тогда
		Возврат Неопределено;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Строка(Значение.УникальныйИдентификатор());	
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции // ФункцияПреобразования() 

#КонецОбласти // ПрограммныйИнтерфейс

#Область СервисныеПроцедурыИФункции



#КонецОбласти // СервисныеПроцедурыИФункции